import { TAGS } from '../constants/tags';

export const questions = [
  {
    id: 1,
    text: "最近はストレスを感じることが多いですか？",
    tags: [TAGS['ストレス軽減'], TAGS['心の平穏'], TAGS['ポジティブエネルギー']]
  },
  {
    id: 2,
    text: "身体を動かすことは好きですか？",
    tags: [TAGS['身体リフレッシュ'], TAGS['精神統一']]
  },
  {
    id: 3,
    text: "集中力が続かないと感じることがありますか？",
    tags: [TAGS['集中力アップ'], TAGS['精神統一']]
  },
  {
    id: 4,
    text: "深く考えすぎて疲れがちですか？",
    tags: [TAGS['自己認識向上'], TAGS['ストレス軽減']]
  },
  {
    id: 5,
    text: "自己理解を深めたいと思いますか？",
    tags: [TAGS['自己認識向上'], TAGS['心の平穏']]
  },
  {
    id: 6,
    text: "静かな環境でじっと座ることに抵抗はありませんか？",
    tags: [TAGS['集中力アップ'], TAGS['精神統一']]
  },
  {
    id: 7,
    text: "他者とのポジティブな関係を大切にしていますか？",
    tags: [TAGS['ポジティブエネルギー']]
  },
  {
    id: 8,
    text: "自然の中で過ごすことが好きですか？",
    tags: [TAGS['身体リフレッシュ'], TAGS['心の平穏'], TAGS['ポジティブエネルギー']]
  },
  {
    id: 9,
    text: "食事をもっと丁寧に味わいたいと思いますか？",
    tags: [TAGS['楽しみ増進'], TAGS['身体リフレッシュ'], TAGS['集中力アップ']]
  },
  {
    id: 10,
    text: "思考を整理し、リラックスする時間を持ちたいですか？",
    tags: [TAGS['精神統一'], TAGS['心の平穏']]
  },
  {
    id: 11,
    text: "日々の小さな楽しみを大切にしていますか？",
    tags: [TAGS['楽しみ増進'], TAGS['ポジティブエネルギー']]
  },
  {
    id: 12,
    text: "自分の感情をしっかりと観察したいと思いますか？",
    tags: [TAGS['自己認識向上'], TAGS['ストレス軽減']]
  },
  {
    id: 13,
    text: "周囲の音や環境が気になって集中しづらいことがありますか？",
    tags: [TAGS['集中力アップ'], TAGS['ストレス軽減']]
  },
  {
    id: 14,
    text: "怒りや悲しみなど強い感情に流されず、心を落ち着ける方法を探していますか？",
    tags: [TAGS['心の平穏'], TAGS['ストレス軽減'], TAGS['ポジティブエネルギー']]
  },
  {
    id: 15,
    text: "自己成長を意識して日々過ごしたいですか？",
    tags: [TAGS['自己認識向上'], TAGS['精神統一']]
  },
  {
    id: 16,
    text: "他の人のために無償の愛を送ることに興味がありますか？",
    tags: [TAGS['ポジティブエネルギー'], TAGS['自己認識向上']]
  },
  {
    id: 17,
    text: "目を閉じて静かに座るのは苦手ですか？",
    tags: [TAGS['身体リフレッシュ'], TAGS['ストレス軽減'], TAGS['楽しみ増進']]
  },
  {
    id: 18,
    text: "無理せず楽しくできる瞑想を探してますか？",
    tags: [TAGS['楽しみ増進'], TAGS['身体リフレッシュ']]
  },
  {
    id: 19,
    text: "忙しいときでも、楽しみを見つける余裕を持っていますか？",
    tags: [TAGS['楽しみ増進']]
  },
  {
    id: 20,
    text: "長時間の作業を続けると、集中力が落ちてしまうことが多いですか？",
    tags: [TAGS['集中力アップ'], TAGS['精神統一']]
  }
];
